---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.GetBasicIEnumerator
source: html/c041e1dc-1e0d-389d-416f-85e1ca463843.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.